

# d = datetime.datetime.today()
# print(d) #Текущая дата#
#
# date = d.strftime("%d-%m-%Y")
# print(date)

# #%y |21| Год, краткая версия, без века (2021)
# %Y |2021| Год, полная версия
# %d |31| День месяца 01-31
# %b | Dec | Название месяца, краткая версия
# %B | December | название месяца, полная версия
# %m | 12 | Месяц в виде числа 01-12, январь - 01
# %a |Wed| Будний день, краткая версия
# %A |Wednesday| Будний день, полная версия
# %w |3| Будний день в виде числа 0-6, 0- =воскресенье
# %H |17| Час 00-23(24-часовой формат)
# %M |35| Минута 00-59
# %S |14| Секунда 00-59
# %c |Tue DEC 10 17:41:00 2019| Местная версия даты
# %x |12.10.2019| Местная версия даты и времени (мм/dd/yy)
# %X |17:41:00| Местная версия времени


# t = datetime.datetime.now()
# print(f"Текущее время: {t}")

# if m == 1:
#     ru = "Января"
# elif m == 2:
#     ru = "Февраля"
# elif m == 3:
#     ru = "Мара"
# elif m == 4:
#     ru = "Апреля"
# elif m == 5:
#     ru = "Мая"
# elif m == 6:
#     ru = "Июня"
# elif m == 7:
#     ru = "Июля"
# elif m == 8:
#     ru = "Августа"
# elif m == 9:
#     ru = "Сентября"
# elif m == 10:
#     ru = "Октября"
# elif m == 11:
#     ru = "Ноября"
# elif m == 12:
#     ru = "Декабря"
# print(f"сегодня {t.day} {ru} {t.year} года")





# date = t.strftime("%d.%B %Y")
# print(f"Сегодня: {date}")


import datetime

t = datetime.date.today()
ru = ""
m = t.month       # Храним номер месяца в m
s = ["Января","Февраля","Марта","Апреля","Мая","Июня","Июля",
     "Августа","Сентября","Октября","Ноября","Декабря"]
month_ru = s[m - 1]

print(f"Сегодня {t.day} {month_ru} {t.year} года.")



















